### Terraform Environment Changes "prod"
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
data.terraform_remote_state.shared: Reading...
random_password.database: Refreshing state... [id=none]
zitadel_project.project: Refreshing state... [id=342477345380127384]
zitadel_machine_user.api-access: Refreshing state... [id=342477345581453976]
data.google_project.project: Reading...
data.google_iam_policy.noauth: Reading...
google_secret_manager_secret.db-pass: Refreshing state... [id=projects/cas-fee-adv-2025/secrets/qwacker-api-prod-db-pass]
google_secret_manager_secret.storage-access: Refreshing state... [id=projects/cas-fee-adv-2025/secrets/qwacker-api-prod-storage-access]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_service_account.gcs-access: Refreshing state... [id=projects/cas-fee-adv-2025/serviceAccounts/qwacker-api-prod-gcs@cas-fee-adv-2025.iam.gserviceaccount.com]
google_storage_bucket.gcs-bucket: Refreshing state... [id=qwacker-api-prod-data]
google_secret_manager_secret.api-access-pat: Refreshing state... [id=projects/cas-fee-adv-2025/secrets/qwacker-api-prod-api-access-pat]
google_secret_manager_secret.api-auth-jwt: Refreshing state... [id=projects/cas-fee-adv-2025/secrets/qwacker-api-prod-api-auth-jwt]
google_service_account_key.gcs-access-key: Refreshing state... [id=projects/cas-fee-adv-2025/serviceAccounts/qwacker-api-prod-gcs@cas-fee-adv-2025.iam.gserviceaccount.com/keys/400e36c0d2dbc4e6b44fa3200335735cd2b20f74]
google_secret_manager_secret_version.db-pass: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-db-pass/versions/1]
google_secret_manager_secret_version.storage-access: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-storage-access/versions/1]
data.google_project.project: Read complete after 0s [id=projects/cas-fee-adv-2025]
google_storage_bucket_iam_member.gcs-bucket: Refreshing state... [id=b/qwacker-api-prod-data/roles/storage.objectViewer/allUsers]
google_storage_bucket_iam_member.gcs-iam: Refreshing state... [id=b/qwacker-api-prod-data/roles/storage.admin/serviceAccount:qwacker-api-prod-gcs@cas-fee-adv-2025.iam.gserviceaccount.com]
zitadel_application_api.api: Refreshing state... [id=342477345665340056]
zitadel_personal_access_token.api-access: Refreshing state... [id=342477346151865447]
zitadel_application_oidc.frontend: Refreshing state... [id=342477345665471128]
zitadel_org_member.api-access: Refreshing state... [id=338558858827942346_342477345581453976]
google_secret_manager_secret_version.api-access-pat: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-api-access-pat/versions/1]
zitadel_application_key.app-key: Refreshing state... [id=342477345950538855]
google_secret_manager_secret_version.api-auth-jwt: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-api-auth-jwt/versions/1]
data.terraform_remote_state.shared: Read complete after 4s
google_secret_manager_secret_iam_member.storage-access: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-storage-access/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com]
google_sql_database.db: Refreshing state... [id=projects/cas-fee-adv-2025/instances/qwacker-api-pgsql-14/databases/qwacker-api-prod]
google_secret_manager_secret_iam_member.api-access-pat: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-api-access-pat/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com]
google_secret_manager_secret_iam_member.db-pass: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-db-pass/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com]
google_sql_user.db-user: Refreshing state... [id=qwacker-api-prod//qwacker-api-pgsql-14]
google_secret_manager_secret_iam_member.api-auth-jwt: Refreshing state... [id=projects/927407260649/secrets/qwacker-api-prod-api-auth-jwt/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com]
google_cloud_run_service.api["http"]: Refreshing state... [id=locations/europe-west6/namespaces/cas-fee-adv-2025/services/qwacker-api-http-prod]
google_cloud_run_service.api["grpc"]: Refreshing state... [id=locations/europe-west6/namespaces/cas-fee-adv-2025/services/qwacker-api-grpc-prod]
google_cloud_run_service.grpcwebproxy: Refreshing state... [id=locations/europe-west6/namespaces/cas-fee-adv-2025/services/qwacker-api-grpcwebproxy-prod]
google_cloud_run_service_iam_policy.noauth["grpcweb"]: Refreshing state... [id=v1/projects/cas-fee-adv-2025/locations/europe-west6/services/qwacker-api-grpcwebproxy-prod]
google_cloud_run_service_iam_policy.noauth["grpc"]: Refreshing state... [id=v1/projects/cas-fee-adv-2025/locations/europe-west6/services/qwacker-api-grpc-prod]
google_cloud_run_service_iam_policy.noauth["http"]: Refreshing state... [id=v1/projects/cas-fee-adv-2025/locations/europe-west6/services/qwacker-api-http-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_service.api["grpc"] will be updated in-place
  ~ resource "google_cloud_run_service" "api" {
        id                         = "locations/europe-west6/namespaces/cas-fee-adv-2025/services/qwacker-api-grpc-prod"
        name                       = "qwacker-api-grpc-prod"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (5 unchanged attributes hidden)

              ~ containers {
                  ~ image       = "europe-west6-docker.pkg.dev/cas-fee-adv-2025/qwacker-api-docker/cas-fee-adv-qwacker-api:1.15.10" -> "europe-west6-docker.pkg.dev/cas-fee-adv-2025/qwacker-api-docker/cas-fee-adv-qwacker-api:0.0.0-plan-preview"
                    name        = null
                    # (3 unchanged attributes hidden)

                  - env {
                      - name  = "AUTH_REDIRECT_URI" -> null
                      - value = "https://qwacker-api-http-prod-4cxdci3drq-oa.a.run.app/rest/oauth2-redirect.html" -> null
                    }
                  + env {
                      + name  = "AUTH_REDIRECT_URI"
                      + value = "https://qwacker-api-http-prod-927407260649.europe-west6.run.app/rest/oauth2-redirect.html"
                    }

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (16 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.api["http"] will be updated in-place
  ~ resource "google_cloud_run_service" "api" {
        id                         = "locations/europe-west6/namespaces/cas-fee-adv-2025/services/qwacker-api-http-prod"
        name                       = "qwacker-api-http-prod"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (5 unchanged attributes hidden)

              ~ containers {
                  ~ image       = "europe-west6-docker.pkg.dev/cas-fee-adv-2025/qwacker-api-docker/cas-fee-adv-qwacker-api:1.15.10" -> "europe-west6-docker.pkg.dev/cas-fee-adv-2025/qwacker-api-docker/cas-fee-adv-qwacker-api:0.0.0-plan-preview"
                    name        = null
                    # (3 unchanged attributes hidden)

                  - env {
                      - name  = "AUTH_REDIRECT_URI" -> null
                      - value = "https://qwacker-api-http-prod-4cxdci3drq-oa.a.run.app/rest/oauth2-redirect.html" -> null
                    }
                  + env {
                      + name  = "AUTH_REDIRECT_URI"
                      + value = "https://qwacker-api-http-prod-927407260649.europe-west6.run.app/rest/oauth2-redirect.html"
                    }

                  ~ resources {
                      ~ limits   = {
                          - "cpu"    = "1000m" -> null
                            # (1 unchanged element hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }

                    # (16 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.grpcwebproxy will be updated in-place
  ~ resource "google_cloud_run_service" "grpcwebproxy" {
        id                         = "locations/europe-west6/namespaces/cas-fee-adv-2025/services/qwacker-api-grpcwebproxy-prod"
        name                       = "qwacker-api-grpcwebproxy-prod"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (5 unchanged attributes hidden)

              ~ containers {
                  ~ image       = "europe-west6-docker.pkg.dev/cas-fee-adv-2025/qwacker-api-docker/cas-fee-adv-qwacker-grpcwebproxy:1.15.10" -> "europe-west6-docker.pkg.dev/cas-fee-adv-2025/qwacker-api-docker/cas-fee-adv-qwacker-grpcwebproxy:0.0.0-plan-preview"
                    name        = null
                    # (3 unchanged attributes hidden)

                    # (3 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_secret_manager_secret_iam_member.api-access-pat must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "api-access-pat" {
      ~ etag      = "BwZBSEN4Fzc=" -> (known after apply)
      ~ id        = "projects/927407260649/secrets/qwacker-api-prod-api-access-pat/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "927407260649" -> (known after apply)
      ~ secret_id = "projects/927407260649/secrets/qwacker-api-prod-api-access-pat" -> "projects/927407260649/secrets/qwacker-api-prod-api-access-pat/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_secret_manager_secret_iam_member.api-auth-jwt must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "api-auth-jwt" {
      ~ etag      = "BwZBSEN1QZ0=" -> (known after apply)
      ~ id        = "projects/927407260649/secrets/qwacker-api-prod-api-auth-jwt/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "927407260649" -> (known after apply)
      ~ secret_id = "projects/927407260649/secrets/qwacker-api-prod-api-auth-jwt" -> "projects/927407260649/secrets/qwacker-api-prod-api-auth-jwt/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_secret_manager_secret_iam_member.db-pass must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "db-pass" {
      ~ etag      = "BwZBSEN03r4=" -> (known after apply)
      ~ id        = "projects/927407260649/secrets/qwacker-api-prod-db-pass/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "927407260649" -> (known after apply)
      ~ secret_id = "projects/927407260649/secrets/qwacker-api-prod-db-pass" -> "projects/927407260649/secrets/qwacker-api-prod-db-pass/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # google_secret_manager_secret_iam_member.storage-access must be replaced
-/+ resource "google_secret_manager_secret_iam_member" "storage-access" {
      ~ etag      = "BwZBSEN2GTI=" -> (known after apply)
      ~ id        = "projects/927407260649/secrets/qwacker-api-prod-storage-access/roles/secretmanager.secretAccessor/serviceAccount:cloud-runner@cas-fee-adv-2025.iam.gserviceaccount.com" -> (known after apply)
      ~ project   = "927407260649" -> (known after apply)
      ~ secret_id = "projects/927407260649/secrets/qwacker-api-prod-storage-access" -> "projects/927407260649/secrets/qwacker-api-prod-storage-access/versions/1" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # zitadel_application_oidc.frontend will be updated in-place
  ~ resource "zitadel_application_oidc" "frontend" {
        id                           = "342477345665471128"
        name                         = "Frontend"
      ~ redirect_uris                = [
            # (6 unchanged elements hidden)
            "https://cas-fee-adv-qwacker-app.vercel.app/api/auth/callback/zitadel",
          - "https://qwacker-api-http-prod-4cxdci3drq-oa.a.run.app/rest/oauth2-redirect.html",
          - "https://mumble-yeahyeahyeah.ch/api/auth/callback/zitadel",
          - "https://www.mumble-yeahyeahyeah.ch/api/auth/callback/zitadel",
          + "https://qwacker-api-http-prod-927407260649.europe-west6.run.app/rest/oauth2-redirect.html",
            "http://host.docker.internal:3000/api/auth/callback/zitadel",
        ]
        # (18 unchanged attributes hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>